package decompositionUsingMethods.homeTask12;

//  12. Даны натуральные числа К и N. Написать метод(методы) формирования массива А,
//  элементами которого являются числа, сумма цифр которых равна К и которые не большее N.
public class ArrayElement {
    public static void main(String[] args) {
        ArrayCreation arrayCreation = new ArrayCreation(9, 200);
        System.out.println(arrayCreation);
    }
}
