package decompositionUsingMethods.homeTask10;

//  10. Дано натуральное число N. Написать метод(методы) для формирования массива, элементами которого являются цифры числа N.
public class ArrayNumber {
    public static void main(String[] args) {
        FormedArray formedArray = new FormedArray(1654327849);
        System.out.println(formedArray);
    }
}
