package decompositionUsingMethods.homeTask9;

//  9. Даны числа X, Y, Z, Т — длины сторон четырехугольника. Написать метод(методы) вычисления его площади,
//   если угол между сторонами длиной X и Y— прямой.
public class AreaQuadrangle {
    public static void main(String[] args) {
        Quadrangle quadrangle = new Quadrangle(10, 5, 7, 8);
        System.out.println(quadrangle);
    }
}
