package decompositionUsingMethods.homeTask1;

//  1. Написать метод(методы) для нахождения наибольшего общего делителя и
//  наименьшего общего кратного двух натуральных чисел
public class СommonDivisorAndMultiple {
    public static void main(String[] args) {
        NaturalIntegers naturalIntegers = new NaturalIntegers(9, 21);
        System.out.println(naturalIntegers);
    }
}
